function crossTabTest(){
  const v = {};
  const tData = [
    {"年度":2011,"項目名":"流動資産","表示順":2,"本体":11000,"税額":0,"合計":11000},
    {"年度":2011,"項目名":"現金","表示順":3,"本体":1000,"税額":0,"合計":1000},
    {"年度":2011,"項目名":"普通預金","表示順":4,"本体":10000,"税額":0,"合計":10000},
    {"年度":2012,"項目名":"流動資産","表示順":2,"本体":6000,"税額":0,"合計":6000},
    {"年度":2012,"項目名":"現金","表示順":3,"本体":-2000,"税額":0,"合計":-2000},
    {"年度":2012,"項目名":"普通預金","表示順":4,"本体":8000,"税額":0,"合計":8000},
  ];
  v.r = crossTab(tData,['項目名'],'年度',['本体','税額','合計']);
  console.log(`v.r=${JSON.stringify(v.r)}`)
}