/** config: アプリケーションの設定情報
 * - 複数のライブラリを使用可能にするため、第一レベルはアプリ名とする
 * - 秘匿情報はここで設定せず、アプリ側で追加・修正する
 */
export const config = {
  // -------------------------------------------------------------
  // authClient/Server共通設定情報
  // -------------------------------------------------------------
  adminMail:"ena.kaon@gmail.com",
  adminName:"あどみ",
  
  // -------------------------------------------------------------
  // authClient専用設定情報
  // -------------------------------------------------------------
  // 現在開発用(http://script.google.com/macros/s/〜/dev)。
  // 本番時には"http://script.google.com/macros/s/〜/exec"に書き換えること
  api:"AKfycbyQQAPxNwxKVbT56gVuaSqwG5TNOAEUsxAl8i_hUcQ",

  // -------------------------------------------------------------
  // authServer専用設定情報
  // -------------------------------------------------------------
  func:{
    svFunc: {
      authority: 0,
      do: x => serverFunc(x)
    },
  }
};
