/** userSettings: ユーザ指定が必要な設定情報
 * @name userSettings
 * @desc
 * - authClient/Server, cryptoClient/Server, Member関係各クラスで【ユーザ指定が必須】の項目集
 * - 各クラスの設定項目が多く「どの項目はユーザ指定が必要？」というのが分かりづらいため分離
 * - ここでの設定値は各クラスのconstructorに渡す(不要項目は廃棄)
 * - クライアント側に秘匿する情報はここで設定せず、別途サーバ側で対処する
 */
export const userSettings = {
  // -------------------------------------------------------------
  // authClient/Server共通設定情報
  // -------------------------------------------------------------
  adminMail:"ena.kaon@gmail.com",
  adminName:"あどみ",
  
  // -------------------------------------------------------------
  // authClient設定情報
  // -------------------------------------------------------------
  // 現在開発用(http://script.google.com/macros/s/〜/dev)。
  // 本番時には"http://script.google.com/macros/s/〜/exec"に書き換えること
  api:"AKfycbyQQAPxNwxKVbT56gVuaSqwG5TNOAEUsxAl8i_hUcQ",

  // -------------------------------------------------------------
  // authServer設定情報
  // -------------------------------------------------------------
  func:{
    svFunc: {
      authority: 0,
      do: x => serverFunc(x)
    },
  }

  // -------------------------------------------------------------
  // cryptoClient/Server共通設定情報
  // -------------------------------------------------------------

  // -------------------------------------------------------------
  // cryptoClient設定情報
  // -------------------------------------------------------------

  // -------------------------------------------------------------
  // cryptoServer設定情報
  // -------------------------------------------------------------

  // -------------------------------------------------------------
  // Member設定情報
  // -------------------------------------------------------------
};
